app/controllers/deals_controller.rb

  def index
    @deals = Deal.all
---
SELECT "deals".* FROM "deals"

  def create
    @deal = Deal.new(deal_params)

    respond_to do |format|
      if @deal.save
---
INSERT INTO "deals" ("title", "description", "price", "discounted_price", "quantity", "publish_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @deal.update(deal_params)
---
UPDATE "deals" SET "price" = ?, "discounted_price" = ?, "updated_at" = ? WHERE "deals"."id" = ?  [["price", 2000], ["discounted_price", 1800], ["updated_at", "2019-07-09 14:53:04.470452"], ["id", 5]]

  def destroy
    @deal.destroy
---
DELETE FROM "deals" WHERE "deals"."id" = ?  [["id", 2]]

    def set_deal
      @deal = Deal.find(params[:id])
---
SELECT  "deals".* FROM "deals" WHERE "deals"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]