app/controllers/homepage_controller.rb

SELECT  "user_deals".* FROM "user_deals" WHERE "user_deals"."user_id" = ? AND "user_deals"."deal_id" = ? ORDER BY "user_deals"."id" ASC LIMIT ?  [["user_id", 1], ["deal_id", 5], ["LIMIT", 1]]
---
  def index
    @deal = Deal.todays_deal
    @user_deal = UserDeal.where(user_id: current_user.id, deal_id: @deal.id).first if @deal

SELECT  "user_deals".* FROM "user_deals" WHERE "user_deals"."deal_id" = ? LIMIT ?  [["deal_id", 5], ["LIMIT", 1]]
INSERT INTO "user_deals" ("user_id", "deal_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["deal_id", 5], ["created_at", "2019-07-09 13:35:30.655265"], ["updated_at", "2019-07-09 13:35:30.655265"]]
SELECT  "user_deals".* FROM "user_deals" WHERE "user_deals"."user_id" = ? AND "user_deals"."deal_id" = ? ORDER BY "user_deals"."id" ASC LIMIT ?  [["user_id", 1], ["deal_id", 5], ["LIMIT", 1]]
UPDATE "user_deals" SET "quantity" = ?, "updated_at" = ? WHERE "user_deals"."id" = ?  [["quantity", 1], ["updated_at", "2019-07-09 13:38:04.179892"], ["id", 1]]
---
  def handle_buy_now
    @deal = Deal.find(params[:deal_id])

    if ValidDeal::is_valid_deal(@deal)
      user_deal = UserDeal.where(user_id: current_user.id, deal_id: @deal.id).first_or_create
      user_deal.quantity += 1 # params[:quantity] for more than 1 quantity

      respond_to do |format|
        if user_deal.save!